Revit 2026 API

# RebarContainerItemPitch Property

---

For a spiral, the pitch, or vertical distance traveled in one rotation.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Pitch { get; set; }
```
```vb
Public Property Pitch As Double
	Get
	Set
```
```cpp
public:
property double Pitch {
	double get ();
	void set (double value);
}
```
```fsharp
member Pitch : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: pitch must be positive. |
| InvalidOperationException | This RebarContainerItem is not an instance of a spiral shape. |

Applies only to instances where RebarShape.Definition is of type RebarShapeDefinitionByArc, and its Type property is equal to the value RebarShapeDefinitionByArcType.Spiral.

#### Reference

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace